// 인프런 코테강의 5-5. 쇠막대기
// () 는 레이저
// 쇠막대기의 왼쪽 끝은 여는 괄호, 오른쪽 끝은 닫는 괄호 (=> 괄호쌍 => 스택)
// )를 만났을 때 바로 앞이 (이면 레이저, )를 만났을 때 바로 앞이 ) 이면 막대 끝
function solution(input) {
  let answer = 0;

  let stack = [];

  for (let i = 0; i < input.length; i++) {
    if (input[i] === "(") {
      stack.push(input[i]);
    } else {
      if (input[i - 1] === "(") {
        stack.pop();
        answer += stack.length;
      } else {
        stack.pop();
        answer += 1;
      }
    }
  }

  return answer;
}

console.log(solution("()(((()())(())()))(())"));
console.log(solution("(((()(()()))(())()))(()())"));
console.log(solution("(((()(()()))(())()))(()())(((()(()()))(())()))(()())"));
console.log(
  solution("(((()(()()))(())()))(()())(((()(()()))(())()))(()())(((()())))")
);
console.log(
  solution(
    "(((()(()()))(())()))(()())(((()(()()))(())()))(()())(((()())))(((()(()()))(())()))(()())(((()(()()))(())()))(()())(((()())))(((()(()()))(())()))(()())(((()(()()))(())()))(()())(((()())))(((()(()()))(())()))(()())(((()(()()))(())()))(()())(((()())))(((()(()()))(())()))(()())(((()(()()))(())()))(()())(((()())))(((()(()()))(())()))(()())(((()(()()))(())()))(()())(((()())))"
  )
);
