// 인프런 코테강의 2-12. 멘토링
// m번의 수학테스트 등수를 가지고 멘토와 멘티 정함
// a 학생이 m번의 수학테스트에서 모두 b보다 등수가 앞서면 a가 b의 멘토
// 멘토와 멘티가 짝을 만들 수 있는 경우의 수
function solution(input) {
  let answer = 0;

  let tmpA = 0,
    tmpB = 0;

  let flag = false;

  for (let z = 0; z < input[0].length - 1; z++) {
    for (let j = z + 1; j < input[0].length; j++) {
      tmpA = input[0][z];
      tmpB = input[0][j];

      for (let k = 1; k < input.length; k++) {
        if (input[k].indexOf(tmpA) < input[k].indexOf(tmpB)) {
          flag = true;
        } else {
          flag = false;
          break;
        }
      }

      if (flag) answer++;
    }
  }

  return answer;
}

console.log(
  solution([
    [3, 4, 1, 2],
    [4, 3, 2, 1],
    [3, 1, 4, 2],
  ])
);

console.log(
  solution([
    [19, 15, 4, 17, 12, 18, 6, 3, 11, 14, 1, 8, 13, 9, 2, 20, 5, 16, 10, 7],
    [5, 20, 18, 17, 14, 11, 19, 3, 10, 16, 6, 8, 13, 9, 2, 12, 4, 7, 1, 15],
  ])
);

console.log(
  solution([
    [15, 7, 16, 10, 1, 17, 8, 4, 11, 14, 6, 9, 18, 20, 13, 19, 2, 5, 12, 3],
    [17, 7, 15, 10, 1, 19, 8, 4, 11, 14, 6, 9, 13, 20, 18, 16, 2, 5, 12, 3],
    [19, 7, 15, 10, 1, 16, 8, 11, 4, 14, 6, 9, 18, 20, 13, 17, 2, 5, 12, 3],
    [17, 7, 15, 10, 1, 19, 8, 4, 11, 14, 6, 9, 13, 20, 18, 16, 2, 5, 12, 3],
    [16, 7, 15, 10, 1, 19, 8, 4, 11, 9, 6, 14, 18, 20, 13, 17, 2, 5, 12, 3],
    [17, 7, 15, 10, 1, 19, 8, 4, 11, 14, 6, 9, 13, 20, 18, 16, 2, 5, 12, 3],
    [16, 7, 15, 2, 1, 19, 8, 4, 11, 14, 6, 9, 18, 20, 13, 17, 10, 5, 12, 3],
    [17, 7, 15, 10, 1, 19, 8, 4, 11, 14, 6, 9, 13, 20, 18, 16, 2, 5, 12, 3],
    [16, 7, 15, 10, 1, 19, 8, , 14, 11, 4, 6, 9, 18, 20, 13, 17, 2, 5, 12, 3],
    [17, 7, 15, 10, 1, 19, 8, , 4, 11, 14, 6, 9, 13, 20, 18, 16, 2, 5, 12, 3],
  ])
);
